---
kind: property
id: P:Autodesk.Revit.DB.Electrical.CableTray.CurveNormal
zh: 桥架、线槽
source: html/cd3ec272-4434-7671-04b6-8a148afc2827.htm
---
# Autodesk.Revit.DB.Electrical.CableTray.CurveNormal Property

**中文**: 桥架、线槽

The up-direction vector of the cable tray.

## Syntax (C#)
```csharp
public XYZ CurveNormal { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null
- **Autodesk.Revit.Exceptions.DisabledDisciplineException** - None of the following disciplines is enabled: Mechanical Electrical Piping.